Repository: silverApplesOfTheMoon/BattleBuddy
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

source: English
es: Inglés

source: Spanish
es: Español

source: Start Your Tech Journey Today
es: Comienza tu viaje tecnológico hoy

source: Track Your Progress
es: Sigue tu progreso

source: Welcome to Washington Vets 2 Tech, your dedicated pathway to a career in technology.
es: Bienvenido a Washington Vets 2 Tech, tu camino dedicado hacia una carrera en tecnología.

source: Whether you’re a veteran, a military spouse, or a tech enthusiast, we provide structured entrance exams, interactive learning modules, and study materials to help you succeed.
es: Ya seas un veterano, un cónyuge militar o un entusiasta de la tecnología, ofrecemos exámenes de ingreso estructurados, módulos de aprendizaje interactivos y materiales de estudio para ayudarte a tener éxito.

source: Learn cloud computing, cybersecurity, and software development.
es: Aprende computación en la nube, ciberseguridad y desarrollo de software.

source: Get hands-on training with industry-leading tools.
es: Recibe formación práctica con herramientas líderes en la industria.

source: Prepare for real-world certification exams.
es: Prepárate para exámenes de certificación del mundo real.

source: Get Started
es: Comenzar

source: Choose Your Cohort
es: Elige tu cohorte

source: Server & Cloud Applications
es: Aplicaciones de Servidor y Nube

source: Type of Work:
es: Tipo de Trabajo:

source: Managing virtual machines, configuring cloud services, and ensuring systems remain efficient and scalable.
es: Administración de máquinas virtuales, configuración de servicios en la nube y garantía de que los sistemas sean eficientes y escalables.

source: Ideal Candidate:
es: Candidato Ideal:

source: Organized, detail-oriented individuals comfortable working behind the scenes to maintain infrastructure reliability.
es: Individuos organizados y orientados a los detalles que se sientan cómodos trabajando detrás de escena para mantener la confiabilidad de la infraestructura.

source: Explore
es: Explorar

source: Cloud Application Development
es: Desarrollo de Aplicaciones en la Nube

source: Designing and coding applications that run on AWS, Azure, GCP, or other cloud platforms. Focus on front-end, back-end, or full-stack development.
es: Diseño y codificación de aplicaciones que se ejecutan en AWS, Azure, GCP u otras plataformas en la nube. Enfoque en desarrollo front-end, back-end o full-stack.

source: Creative problem-solvers who enjoy writing code and building modern software solutions that leverage the power of the cloud.
es: Personas creativas y resolutivas que disfrutan escribiendo código y creando soluciones de software modernas que aprovechan el poder de la nube.

source: Cybersecurity Administration
es: Administración de Ciberseguridad

source: Protecting networks, systems, and data from cyber threats and vulnerabilities.
es: Protección de redes, sistemas y datos contra amenazas cibernéticas y vulnerabilidades.

source: Analytical thinkers who thrive under pressure and enjoy safeguarding critical infrastructure against hackers.
es: Pensadores analíticos que prosperan bajo presión y disfrutan protegiendo infraestructuras críticas contra hackers.

source: Take the Cohort Quiz
es: Realizar el cuestionario de cohortes

source: Skip to main content
es: Saltar al contenido principal

source: Go to Home Page
es: Ir a la página principal

source: Language
es: Idioma

source: Main Navigation
es: Navegación principal

source: Home
es: Inicio

source: Manage Users
es: Administrar usuarios

source: About Us
es: Sobre nosotros

source: FAQ
es: Preguntas frecuentes

source: Login
es: Iniciar sesión

source: Register
es: Registrarse

source: Logout
es: Cerrar sesión

source: Go to Saint Martin's University
es: Ir a la Universidad de Saint Martin

source: Saint Martin's University
es: Universidad de Saint Martin

source: Privacy
es: Privacidad

source: Welcome Back!
es: ¡Bienvenido de nuevo!

source: Email
es: Correo electrónico

source: Email Address
es: Dirección de correo electrónico

source: Password
es: Contraseña

source: Forgot Password?
es: ¿Olvidaste tu contraseña?

source: Don’t have an account yet?
es: ¿Aún no tienes una cuenta?

source: Sign Up
es: Regístrate

source: Create an Account
es: Crea una cuenta

source: Full Name
es: Nombre completo

source: Confirm Password
es: Confirmar contraseña

source: Student Type
es: Tipo de estudiante

source: Future Student
es: Estudiante futuro

source: Current Student
es: Estudiante actual

source: Alumni Student
es: Estudiante graduado

source: Neither
es: Ninguno

source: Agree to User Terms and Conditions
es: Aceptar los términos y condiciones del usuario

source: Already have an account?
es: ¿Ya tienes una cuenta?

source: Which Cohort Is Right For You?
es: ¿Qué cohorte es adecuada para ti?

source: Submit Quiz
es: Enviar cuestionario

source: 1. How do you prefer to work?
es: 1. ¿Cómo prefieres trabajar?

source: I love designing and coding innovative applications.
es: Me encanta diseñar y programar aplicaciones innovadoras.

source: I enjoy configuring and managing IT infrastructure.
es: Disfruto configurando y gestionando la infraestructura de TI.

source: I like protecting systems and networks from threats.
es: Me gusta proteger sistemas y redes de amenazas.

source: 2. What aspect of technology excites you the most?
es: 2. ¿Qué aspecto de la tecnología te emociona más?

source: Building user-friendly web applications and software.
es: Construyendo aplicaciones web y software fáciles de usar.

source: Optimizing system performance and scalability.
es: Optimizando el rendimiento y la escalabilidad del sistema.

source: Investigating vulnerabilities and safeguarding data.
es: Investigando vulnerabilidades y protegiendo datos.

source: 3. What type of projects inspire you?
es: 3. ¿Qué tipo de proyectos te inspiran?

source: Developing full-stack applications and interactive interfaces.
es: Desarrollando aplicaciones full-stack e interfaces interactivas.

source: Deploying, monitoring, and managing cloud infrastructure.
es: Desplegando, monitoreando y gestionando infraestructura en la nube.

source: Conducting penetration tests and implementing security measures.
es: Realizando pruebas de penetración e implementando medidas de seguridad.

source: 4. How do you approach problem-solving?
es: 4. ¿Cómo abordas la resolución de problemas?

source: I enjoy creatively coding and prototyping solutions.
es: Disfruto programando creativamente y creando prototipos de soluciones.

source: I systematically troubleshoot and optimize systems.
es: Soluciono problemas y optimizo sistemas de manera sistemática.

source: I analyze risks and design defensive strategies.
es: Analizo riesgos y diseño estrategias defensivas.

source: 5. What work environment appeals most to you?
es: 5. ¿Qué entorno de trabajo te atrae más?

source: A creative, collaborative team developing new software.
es: Un equipo creativo y colaborativo desarrollando nuevo software.

source: A dynamic IT department handling complex infrastructure challenges.
es: Un departamento de TI dinámico manejando desafíos complejos de infraestructura.

source: A security operations center where threats are monitored and mitigated.
es: Un centro de operaciones de seguridad donde se monitorean y mitigan amenazas.

source: 6. How do you prefer to learn?
es: 6. ¿Cómo prefieres aprender?

source: Through hands-on coding projects and interactive tutorials.
es: A través de proyectos de codificación prácticos y tutoriales interactivos.

source: By tackling real-world system and network challenges.
es: Abordando desafíos reales de sistemas y redes.

source: Using simulated security scenarios and case studies.
es: Utilizando escenarios de seguridad simulados y estudios de caso.

source: Need help?
es: ¿Necesitas ayuda?

source: Click on me!
es: ¡Haz clic en mí!

source: Study Helper Chat
es: Chat de ayuda para estudiar

source: Hello! How can I help you today?
es: ¡Hola! ¿Cómo puedo ayudarte hoy?

source: Send
es: Enviar

source: Type your question...
es: Escribe tu pregunta...

source: Skills You Will Learn
es: Habilidades que aprenderás

source: Open Resource
es: Abrir recurso

source: Cloud Development Bootcamp
es: Bootcamp de Desarrollo en la Nube

source: This immersive bootcamp offers a step-by-step guide to building cloud-native applications. Learn key concepts like microservices architecture, containerization, and continuous deployment, using modern tools such as Docker and Kubernetes.
es: Este bootcamp inmersivo ofrece una guía paso a paso para construir aplicaciones nativas en la nube. Aprende conceptos clave como arquitectura de microservicios, contenedorización y despliegue continuo, utilizando herramientas modernas como Docker y Kubernetes.

source: Microservices, Docker, Kubernetes, DevOps pipelines
es: Microservicios, Docker, Kubernetes, Canalizaciones de DevOps

source: Developing on AWS
es: Desarrollando en AWS

source: This resource provides an in-depth introduction to designing, building, and deploying applications on Amazon Web Services (AWS). Learn essential AWS services like Lambda, DynamoDB, and API Gateway.
es: Este recurso ofrece una introducción detallada al diseño, desarrollo y despliegue de aplicaciones en Amazon Web Services (AWS). Aprende servicios esenciales de AWS como Lambda, DynamoDB y API Gateway.

source: AWS Lambda, DynamoDB, API Gateway, Serverless architectures
es: AWS Lambda, DynamoDB, API Gateway, Arquitecturas sin servidor

source: Microsoft Learn: App Development
es: Microsoft Learn: Desarrollo de Aplicaciones

source: Explore the world of cloud application development with Microsoft's free interactive learning platform. This course covers Azure App Services, Azure Functions, and CI/CD pipelines.
es: Explora el mundo del desarrollo de aplicaciones en la nube con la plataforma de aprendizaje interactiva gratuita de Microsoft. Este curso cubre Azure App Services, Azure Functions y canalizaciones CI/CD.

source: Azure App Services, Azure Functions, CI/CD, Cloud scaling
es: Azure App Services, Azure Functions, CI/CD, Escalado en la nube

source: Full-Stack Cloud Development
es: Desarrollo en la Nube Full-Stack

source: This specialization, offered by IBM on Coursera, teaches you how to develop full-stack cloud-based applications, covering front-end frameworks, server-side scripting, and database integration.
es: Esta especialización, ofrecida por IBM en Coursera, te enseña a desarrollar aplicaciones en la nube Full-Stack, cubriendo frameworks de front-end, scripting del lado del servidor e integración de bases de datos.

source: Front-end frameworks, Server-side scripting, Database integration, Continuous delivery
es: Frameworks de front-end, Scripting del lado del servidor, Integración de bases de datos, Entrega continua

source: Google Cloud Application Development
es: Desarrollo de Aplicaciones en Google Cloud

source: Google Cloud's comprehensive learning platform offers tutorials, labs, and certifications to help you master cloud app development, including scalable backend systems and serverless functions.
es: La plataforma de aprendizaje integral de Google Cloud ofrece tutoriales, laboratorios y certificaciones para ayudarte a dominar el desarrollo de aplicaciones en la nube, incluyendo sistemas backend escalables y funciones sin servidor.

source: Google Cloud, Serverless functions, App Engine, Cloud SQL
es: Google Cloud, Funciones sin servidor, App Engine, Cloud SQL

source: IBM Application Development
es: Desarrollo de Aplicaciones IBM

source: Dive into IBM's developer portal to learn about creating cloud-native applications using IBM Cloud services, including Watson AI and Kubernetes.
es: Sumérgete en el portal de desarrolladores de IBM para aprender sobre la creación de aplicaciones nativas en la nube utilizando servicios de IBM Cloud, incluyendo Watson AI y Kubernetes.

source: IBM Cloud, Watson AI, Kubernetes, Advanced cloud development
es: IBM Cloud, Watson AI, Kubernetes, Desarrollo avanzado en la nube

source: CompTIA Security+ is an industry-recognized certification designed for entry-level professionals. This resource covers risk management, network security, and compliance.
es: CompTIA Security+ es una certificación reconocida en la industria, diseñada para profesionales de nivel inicial. Este recurso cubre la gestión de riesgos, la seguridad de redes y el cumplimiento normativo.

source: Network security, Risk management, Compliance, Threat prevention
es: Seguridad de redes, Gestión de riesgos, Cumplimiento normativo, Prevención de amenazas

source: Introduction to Cybersecurity
es: Introducción a la Ciberseguridad

source: Offered by Cisco Networking Academy, this beginner-friendly course introduces the core concepts of cybersecurity, including types of attacks, threat detection, and data protection strategies.
es: Ofrecido por Cisco Networking Academy, este curso para principiantes introduce los conceptos clave de la ciberseguridad, incluyendo tipos de ataques, detección de amenazas y estrategias de protección de datos.

source: Threat detection, Data protection, Basic cyber attacks, Cisco tools
es: Detección de amenazas, Protección de datos, Ataques cibernéticos básicos, Herramientas de Cisco

source: Certified Ethical Hacker
es: Hacker Ético Certificado

source: The CEH certification from EC-Council is a globally respected credential that teaches ethical hacking techniques and methodologies to identify vulnerabilities and strengthen systems against cyberattacks.
es: La certificación CEH del EC-Council es una credencial reconocida a nivel mundial que enseña técnicas y metodologías de hacking ético para identificar vulnerabilidades y fortalecer los sistemas contra ataques cibernéticos.

source: Penetration testing, Vulnerability analysis, Network scanning, Ethical hacking
es: Pruebas de penetración, Análisis de vulnerabilidades, Escaneo de redes, Hacking ético

source: Google Cybersecurity Training
es: Formación en Ciberseguridad de Google

source: This free training program from Google offers hands-on exercises and certification preparation for those interested in practical cybersecurity applications.
es: Este programa de formación gratuita de Google ofrece ejercicios prácticos y preparación para certificaciones para aquellos interesados en aplicaciones prácticas de ciberseguridad.

source: Google security tools, System hardening, Network fundamentals, Cyber labs
es: Herramientas de seguridad de Google, Fortalecimiento del sistema, Fundamentos de redes, Laboratorios de ciberseguridad

source: Stanford Advanced Cybersecurity
es: Ciberseguridad Avanzada de Stanford

source: Offered by Stanford University, this advanced program explores cutting-edge practices in threat analysis, risk assessment, and data protection.
es: Ofrecido por la Universidad de Stanford, este programa avanzado explora prácticas innovadoras en análisis de amenazas, evaluación de riesgos y protección de datos.

source: Threat analysis, Risk assessment, Data protection, Advanced attack vectors
es: Análisis de amenazas, Evaluación de riesgos, Protección de datos, Vectores de ataque avanzados

source: IBM Cybersecurity Analyst
es: Analista de Ciberseguridad de IBM

source: This professional certificate on Coursera provides in-depth knowledge of security intelligence, event management, incident response, and risk analysis.
es: Este certificado profesional en Coursera proporciona conocimientos profundos sobre inteligencia de seguridad, gestión de eventos, respuesta a incidentes y análisis de riesgos.

source: SIEM systems, Incident response, Security analytics, IBM security tools
es: Sistemas SIEM, Respuesta a incidentes, Análisis de seguridad, Herramientas de seguridad de IBM

source: AWS Certified Solutions Architect
es: Arquitecto de Soluciones Certificado por AWS

source: This highly regarded certification by AWS equips you with the knowledge and skills to design, deploy, and operate highly available, cost-effective, and secure applications on AWS.
es: Esta certificación altamente reconocida de AWS te proporciona los conocimientos y habilidades para diseñar, implementar y operar aplicaciones altamente disponibles, rentables y seguras en AWS.

source: AWS architecture, High availability, Cost optimization, Security best practices
es: Arquitectura de AWS, Alta disponibilidad, Optimización de costos, Mejores prácticas de seguridad

source: Microsoft Azure Fundamentals
es: Fundamentos de Microsoft Azure

source: Ideal for beginners, this certification offers a thorough introduction to Microsoft Azure services, covering cloud concepts, core Azure services, pricing, and security fundamentals.
es: Ideal para principiantes, esta certificación ofrece una introducción completa a los servicios de Microsoft Azure, abarcando conceptos de la nube, servicios principales de Azure, precios y fundamentos de seguridad.

source: Azure basics, Cloud concepts, Azure security, Cost management
es: Conceptos básicos de Azure, Conceptos de la nube, Seguridad en Azure, Gestión de costos

source: Introduction to Kubernetes
es: Introducción a Kubernetes

source: This resource from Kubernetes.io introduces you to container orchestration, helping you manage and deploy containers across clusters effectively.
es: Este recurso de Kubernetes.io te introduce a la orquestación de contenedores, ayudándote a administrar e implementar contenedores en clústeres de manera efectiva.

source: Container orchestration, Clusters, Pods & services, Deployment best practices
es: Orquestación de contenedores, Clústeres, Pods y servicios, Mejores prácticas de implementación

source: Google Cloud Fundamentals
es: Fundamentos de Google Cloud

source: Learn the basics of Google Cloud Platform through interactive lessons and hands-on labs, covering cloud computing fundamentals, managing virtual machines, and leveraging Google Cloud's unique features.
es: Aprende los fundamentos de Google Cloud Platform a través de lecciones interactivas y laboratorios prácticos, cubriendo los fundamentos de la computación en la nube, la gestión de máquinas virtuales y las características únicas de Google Cloud.

source: Compute Engine, VM management, GCP fundamentals, Scalability
es: Compute Engine, Gestión de máquinas virtuales, Fundamentos de GCP, Escalabilidad

source: IBM Cloud Learn Hub
es: Centro de Aprendizaje de IBM Cloud

source: The IBM Cloud Learn Hub offers resources on app modernization, AI integration, Kubernetes, and hybrid cloud setups.
es: El Centro de Aprendizaje de IBM Cloud ofrece recursos sobre modernización de aplicaciones, integración de IA, Kubernetes y configuraciones de nube híbrida.

source: IBM Cloud, App modernization, Hybrid cloud, AI integration
es: IBM Cloud, Modernización de aplicaciones, Nube híbrida, Integración de IA

source: Cloud Academy
es: Academia de la Nube

source: Cloud Academy offers interactive quizzes, hands-on labs, and comprehensive courses to help you become a cloud expert across AWS, Azure, Google Cloud, and Kubernetes.
es: Cloud Academy ofrece cuestionarios interactivos, laboratorios prácticos y cursos completos para ayudarte a convertirte en un experto en la nube con AWS, Azure, Google Cloud y Kubernetes.

source: AWS, Azure, Google Cloud, Kubernetes, Continuous learning
es: AWS, Azure, Google Cloud, Kubernetes, Aprendizaje continuo

source: Hello, Current Students!
es: ¡Hola, Estudiantes Actuales!

source: Continue your journey towards mastering tech skills with our interactive learning tools and AI assistant.
es: Continúa tu viaje hacia el dominio de habilidades tecnológicas con nuestras herramientas de aprendizaje interactivas y asistente de IA.

source: Study With Your AI Tutor
es: Estudia con tu Tutor de IA

source: Access exclusive study materials and challenge yourself with adaptive quizzes.
es: Accede a materiales de estudio exclusivos y desafíate con cuestionarios adaptativos.

source: Welcome, Future Students!
es: ¡Bienvenidos, Futuros Estudiantes!

source: We are excited to have you here! Start exploring the tech industry and find the best career path for you.
es: ¡Estamos emocionados de tenerte aquí! Comienza a explorar la industria tecnológica y encuentra el mejor camino profesional para ti.

source: Your Future Starts Here!
es: ¡Tu Futuro Comienza Aquí!

source: Explore study resources, certifications, and mentorship to kickstart your tech career.
es: Explora recursos de estudio, certificaciones y mentoría para impulsar tu carrera en tecnología.

source: Start Learning
es: Comienza a Aprender

source: Welcome Back, Alumni!
es: ¡Bienvenido de Nuevo, Exalumno!

source: Keep learning, stay connected, and explore new opportunities in the tech world.
es: Sigue aprendiendo, mantente conectado y explora nuevas oportunidades en el mundo tecnológico.

source: Stay Ahead in Your Career!
es: ¡Mantente a la Vanguardia en tu Carrera!

source: Access job resources, networking events, and continued learning opportunities.
es: Accede a recursos laborales, eventos de networking y oportunidades de aprendizaje continuo.

source: Join Alumni Network
es: Únete a la Red de Exalumnos
